Revit 2026 API
FamilyItemFactory.NewCurveByPoints Method
Create a 3d curve through two or more points in an Autodesk Revit family document.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public CurveByPoints NewCurveByPoints(
	ReferencePointArray points
)
Public Function NewCurveByPoints (
	points As ReferencePointArray
) As CurveByPoints
public:
CurveByPoints^ NewCurveByPoints(
	ReferencePointArray^ points
)
member NewCurveByPoints :
        points : ReferencePointArray -> CurveByPoints
Parameters
points ReferencePointArray
Two or more PointElements. The curve will interpolate these points.
Return Value
CurveByPoints
The newly created curve.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when points is null.
ArgumentException |  Thrown when points does not contain at least two PointElements.
InvalidOperationException |  Thrown when the family is not a Conceptual Mass Family.
See Also
Reference
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace